package org.example.STREAM.taski;

import java.util.*;
import java.util.stream.Collectors;

public class StreamTasks {
    public static void main(String[] args) {
        // Задача 1: Фильтрация чисел больше 5 и вывод в порядке убывания
        List<Integer> numbers = Arrays.asList(1, 2, 3, 4, 5, 6, 7, 8, 9, 10);


        // Задача 2: Преобразование строк в верхний регистр и удаление дубликатов
        List<String> words = Arrays.asList("apple", "banana", "cherry", "Apple", "Banana", "Cherry");

        // Задача 3: Вывод квадратов чисел, удовлетворяющих условию
        List<Integer> nums = Arrays.asList(1, 2, 3, 4, 5);


        // Задача 4: Подсчет суммы четных чисел
        List<Integer> values = Arrays.asList(1, 2, 3, 4, 5, 6, 7, 8, 9, 10);


        // Задача 5: Преобразование чисел в строки и объединение их с разделителем
        List<Integer> integers = Arrays.asList(1, 2, 3, 4, 5);


//        // Задача 6: Поиск первого четного числа
//        Optional<Integer> firstEven =
//        System.out.println("First Even: " + firstEven.orElse(null));

        // Задача 7: Проверка, все ли строки начинаются с буквы "A"
//        boolean allStartsWithA =
//        System.out.println("All Start With A: " + allStartsWithA);

        // Задача 8: Пропуск первых 3 чисел и сумма оставшихся
//        int sumAfterSkip =
//        System.out.println("Sum After Skip: " + sumAfterSkip);

        // Задача 9: Выбор минимального и максимального числа
//        Optional<Integer> minValue = numbers.stream().min(Integer::compareTo);
//        Optional<Integer> maxValue = numbers.stream().max(Integer::compareTo);
//        System.out.println("Min Value: " + minValue.orElse(null));
//        System.out.println("Max Value: " + maxValue.orElse(null));
//
//        // Задача 10: Группировка слов по длине
//        Map<Integer, List<String>> wordsByLength =
//        System.out.println("Words By Length: " + wordsByLength);
//
//        // Задача 11: Подсчет среднего значения чисел
//        OptionalDouble average =
//        System.out.println("Average: " + average.orElse(0));
//
//        // Задача 12: Поиск всех слов, содержащих букву "a"
//        List<String> wordsWithA =
//        System.out.println("Words with 'a': " + wordsWithA);
//
//        // Задача 13: Преобразование чисел в квадрат и сортировка в обратном порядке
//        List<Integer> sortedSquares =
//        System.out.println("Sorted Squares: " + sortedSquares);
//
//        // Задача 14: Преобразование чисел в двоичный формат и объединение в строку
//        List<Integer> binaryNumbers =
//        System.out.println("Binary String: " + binaryString);
//
//        // Задача 15: Фильтрация чисел, кратных 3, и преобразование их в строки
//        List<String> numbersDivisibleByThree =
//        System.out.println("Numbers Divisible by 3: " + numbersDivisibleByThree);
    }
}